ruby-on-rails-bootcamp/stimulus/api-stimulus/app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @students = Student.all

INSERT INTO "students" ("name", "phone", "code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "teste"], ["phone", "12321414141"], ["code", "734424"], ["created_at", "2024-08-18 18:55:16.207564"], ["updated_at", "2024-08-18 18:55:16.207564"]]
---
  def create
    @student = Student.new(student_params)

    if @student.save

UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "teste 2"], ["updated_at", "2024-08-18 18:55:21.724989"], ["id", 1]]
---
  def update
    if @student.update(student_params)

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def destroy
    @student.destroy!

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_student
      @student = Student.find(params[:id])